<?php

namespace App\Livewire\Admin;

use Livewire\Component;

class User extends Component
{
    public PostForm $form;
    public $states, $state, $cites, $city, $pleatformes,
        $platform, $categories, $category,
        $name, $number, $experience, $experiences, $website,$instagram,$avatar;

    public function mount()
    {

        $this->states = [
            "اصفهان",
            "البرز",
            "بوشهر",
            "تهران",
            "فارس",
            "خراسان‌جنوبی",
            "خراسان‌رضوی",
            "خراسان‌شمالی",
            "خوزستان",
            "مازندران",
            "هرمزگان",
            "همدان",
            "یزد",
            "کرمان",
            "كرمانشاه"
        ];
        $this->pleatformes = [
            "دیوار",
            "شیپور",
            "nobat.ir",
            "paziresh24",
            "doctoreto",
        ];
        $this->categories = [
            "پزشکی",
            "زیبایی"
        ];

    }

    public function updated()
    {
        if ($this->category=="پزشکی"){
            $this->experiences = [
                " زنان و زایمان",
                "مغز و اعصاب",
                "گوش حلق و بینی",
                "ارتوپدی",
                "کلیه و مجاری ادراری",
                "پوست و مو",
                "چشم پزشکی",
                "گوارش ، کبد و آندوسکوپی",
                "قلب و عروق",
                "رادیولوژی و سونوگرافی",
                "غدد، رشد و متابولیسم",
                "روانپزشکی و روان‌شناسی",
                "کودکان و نوزادان ( اطفال )",
                "جراحی عمومی",
                "دندان پزشکی",
                "ریه و دستگاه تنفسی",
                "داخلی",
                "جراحی پلاستیک و زیبایی",
                "خون و سرطان",
                "تغذیه",
                "مامایی",
                "عفونی",
                "عمومی",
                "طب فیزیکی و توان بخشی",
                "فیزیوتراپی",
                "کایروپراکتیک",
                "آسیب شناسی(پاتولوژی)",
                "بیهوشی و درد",
                "آزمایشگاه ها",
                "انکولوژیست (پرتو درمانی و ..)",
                "ژنتیک و پزشکی هسته ای",
                "سم شناسی بالینی و مسمومیتها",
                "طب کار و بیماری های شغلی",
                "آسم ، آلرژی و ایمونولوژی بالینی",
                "پزشکی قانونی و مسمومیت ها",
                "طب سنتی ایرانی",
                "طب اورژانس",
                "بینایی سنجی (اپتومتری)",
                "شنوایی سنجی (ادیولوژی)",
                "پزشکی ورزشی و طب ورزشی",
                "روماتولوژی",
                "گفتار درمانی و کار درمانی",
                "متخصص و جراح دهان ، فک و صورت",
                "ارتوپدی فنی",
            ];
        }

        if ($this->state == "اصفهان") {
            $this->cites = [
                "اصفهان",
                "خمینی شهر",
                "خوانسار",
                "خور و بیابانک",
                "شاهین شهرومیمه",
                "فلاورجان",
                "کاشان",
                "گلپایگان",
                "مبارکه",
                "نایین",
                "نجف آباد",
                "نطنز"
            ];
        };

        if ($this->state == "البرز") {
            $this->cites = [
                "فردیس",
                "کرج",
                "نظرآباد"
            ];
        };

        if ($this->state == "بوشهر") {
            $this->cites = [
                "بوشهر",
                "تنگستان",
                "جم",
                "دشتستان",
                "دشتی",
                "دیر",
                "دیلم",
                "عسلویه",
                "كنگان",
                "گناوه"
            ];
        };

        if ($this->state == "تهران") {
            $this->cites = [
                "اسلامشهر",
                "بهارستان",
                "پاكدشت",
                "پردیس",
                "پیشوا",
                "تهران",
                "دماوند",
                "شمیرانات",
                "شهریار",
                "قرچک",
                "ملارد",
                "ورامین"
            ];
        };

        if ($this->state == "فارس") {
            $this->cites = [
                "جهرم",
                "شیراز",
                "لارستان",
                "لامرد",
                "مرودشت"
            ];
        };

        if ($this->state == "خراسان‌جنوبی") {
            $this->cites = [
                "بیرجند",
                "سرایان",
                "سربیشه",
                "طبس",
                "فردوس",
                "قائنات",
                "نهبندان"
            ];
        };

        if ($this->state == "خراسان‌رضوی") {
            $this->cites = [
                "بینالود",
                "تربت جام",
                "تربت حیدریه",
                "سبزوار",
                "سرخس",
                "فیروزه",
                "قوچان",
                "كاشمر",
                "مشهد",
            ];
        };

        if ($this->state == "خراسان‌شمالی") {
            $this->cites = [
                "اسفراین",
                "بجنورد",
                "جاجرم",
                "راز و جرگلان",
                "شیروان",
                "فاروج",
                "گرمه",
                "مانه وسملقان"
            ];
        };

        if ($this->state == "خوزستان") {
            $this->cites = [
                "امیدیه",
                "اندیکا",
                "اندیمشک",
                "اهواز",
                "ایذه",
                "آبادان",
                "آغاجاری",
                "باغ ملک",
                "بندرماهشهر",
                "بهبهان",
                "حمیدیه",
                "خرمشهر",
                "دزفول",
                "رامشیر",
                "رامهرمز",
                "شادگان",
                "شوش",
                "شوشتر",
                "کارون",
                "گتوند",
                "لالی",
                "مسجدسلیمان",
                "هفتگل",
                "هندیجان",
                "هویزه"
            ];
        };

        if ($this->state == "مازندران") {
            $this->cites = [
                "آمل",
                "بابل",
                "بابلسر",
                "بهشهر",
                "تنكابن",
                "چالوس",
                "رامسر",
                "سارئ",
                "سوادكوه",
                "فریدونكنار",
                "قائم شهر",
                "کلاردشت",
                "نوشهر"
            ];
        };

        if ($this->state == "هرمزگان") {
            $this->cites = [
                "ابوموسی",
                "بستك",
                "بندرعباس",
                "بندرلنگه",
                "پارسیان",
                "جاسك",
                "خمیر",
                "رودان",
                "سیریك",
                "قشم",
                "میناب",
            ];
        };

        if ($this->state == "همدان") {
            $this->cites = [
                "بهار",
                "تویسركان",
                "فامنین",
                "ملایر",
                "نهاوند",
                "همدان"
            ];
        };

        if ($this->state == "یزد") {
            $this->cites = [
                "ابركوه",
                "اردكان",
                "بافق",
                "بهاباد",
                "تفت",
                "خاتم",
                "مهریز",
                "میبد"
            ];
        };

        if ($this->state == "کرمان") {
            $this->cites = [
                "بافت",
                "بردسیر",
                "بم",
                "جیرفت",
                "رابر",
                "رفسنجان",
                "زرند",
                "سیرجان",
                "شهربابك",
                "عنبرآباد",
                "فاریاب",
                "كرمان",
                "كهنوج",
                "منوجان",
            ];
        };

        if ($this->state == "كرمانشاه") {
            $this->cites = [
                2 => "پاوه",
                10 => "قصرشیرین",
                11 => "کرمانشاه",
                12 => "کنگاور",
                14 => "هرسین"
            ];

        };


    }

    public function addAdvertising()
    {

        \App\Models\User::create([
            "name" => $this->name,
            "phone" => $this->number,
            "role_id"=>2,
            "data"=>
            [
                "state" => $this->state,
                "city" => $this->city,
                "platform" => $this->platform,
                "category" => $this->category,
                "experience" => $this->experience,
                "website" => $this->website,
                "instagram" => $this->instagram,
            ]
        ]);
        $this->reset("city", "platform", "category",
            "name", "number", "experience", "website", "instagram");
    }

    public function render()
    {
        return view('livewire.admin.user');
    }
}
